<template>
  <div class="bg-[var(--blue)] text-[white] pb-4">
    <div class="containerr flex gap-8">
      <div
        class="bg-[var(--red)] first pt-20 pr-12 pb-12 pl-4 max-w-[450px] col-span-2 ml-10"
      >
        <img class="w-[75px] h-[60px]" src="../assets/logo.png" alt="" />
        <div class="mt-5 text-[20px] leading-[1.8] font-thin">
          متجر سبورتفاي متخصص في بيع جميع مسلتزمات المكياج والعناية بالبشرة
          لتحصلي على بشرة احلامك وتحافظي على نضارتها مع جميع منتجات العناية
          بالبشرة ولتتألقي مع جميع منتجاتنا للمكياج.
        </div>
        <div class="mt-40 number flex items-center">
          <img class="ml-3" src="../assets/vat.png" alt="" />
          <p>الرقم الضريبي : 546987552</p>
        </div>
        <div class="mt-4 visa gap-4 flex items-center">
          <img src="../assets/master.png" alt="" />
          <img src="../assets/visa.png" alt="" />
          <img src="../assets/mada.png" alt="" />
          <img src="../assets/paypal.png" alt="" />
        </div>
      </div>
      <div class="grid grid1 grid-cols-3">
        <div class="pt-20">
          <p class="font-bold text-[24px]">روابط مهمة</p>
          <div class="flex flex-col gap-4 mt-7">
            <p class="text-[20px] font-thin">سياسة الخصوصية</p>
            <p class="text-[20px] font-thin">الشحن والاسترجاع</p>
            <p class="text-[20px] font-thin">الشروط والأحكام</p>
            <p class="text-[20px] font-thin">الدعم الفني</p>
          </div>
        </div>
        <div class="pt-20">
          <p class="font-bold text-[24px]">تواصل معنا</p>
          <div class="flex flex-col gap-4 mt-7">
            <p class="text-[20px] font-thin flex gap-1">
              <svg
                width="18px"
                fill="white"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
              >
                <path
                  d="M224.2 89C216.3 70.1 195.7 60.1 176.1 65.4L170.6 66.9C106 84.5 50.8 147.1 66.9 223.3C104 398.3 241.7 536 416.7 573.1C493 589.3 555.5 534 573.1 469.4L574.6 463.9C580 444.2 569.9 423.6 551.1 415.8L453.8 375.3C437.3 368.4 418.2 373.2 406.8 387.1L368.2 434.3C297.9 399.4 241.3 341 208.8 269.3L253 233.3C266.9 222 271.6 202.9 264.8 186.3L224.2 89z"
                />
              </svg>
              009612345678932
            </p>
            <p class="text-[20px] font-thin flex gap-1">
              <svg
                width="18px"
                fill="white"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
              >
                <path
                  d="M224.2 89C216.3 70.1 195.7 60.1 176.1 65.4L170.6 66.9C106 84.5 50.8 147.1 66.9 223.3C104 398.3 241.7 536 416.7 573.1C493 589.3 555.5 534 573.1 469.4L574.6 463.9C580 444.2 569.9 423.6 551.1 415.8L453.8 375.3C437.3 368.4 418.2 373.2 406.8 387.1L368.2 434.3C297.9 399.4 241.3 341 208.8 269.3L253 233.3C266.9 222 271.6 202.9 264.8 186.3L224.2 89z"
                />
              </svg>
              009612345678932
            </p>

            <p class="text-[20px] font-thin flex gap-1">
              <svg
                width="16px"
                fill="white"
                xmlns="http://www.w3.org/2000/svg"
                viewBox="0 0 640 640"
              >
                <path
                  d="M112 128C85.5 128 64 149.5 64 176C64 191.1 71.1 205.3 83.2 214.4L291.2 370.4C308.3 383.2 331.7 383.2 348.8 370.4L556.8 214.4C568.9 205.3 576 191.1 576 176C576 149.5 554.5 128 528 128L112 128zM64 260L64 448C64 483.3 92.7 512 128 512L512 512C547.3 512 576 483.3 576 448L576 260L377.6 408.8C343.5 434.4 296.5 434.4 262.4 408.8L64 260z"
                />
                <span>https://salla.sa</span>
              </svg>
            </p>
          </div>
        </div>
        <div class="pt-20 w-[120%]">
          <p class="font-bold text-[24px]">النشرة البريدية</p>
          <div class="flex flex-col gap-4 mt-7 pb-5 border-b">
            <p class="text-[16px] font-thin flex justify-between items-center">
              أدخل بريدك الالكتروني
              <span
                class="text-[var(--red)] text-[20px] font-normal flex justigy-center items-center gap-1"
                >اشترك الان
                <svg
                  width="20px"
                  fill="var(--red)"
                  class="rotate-[-45deg]"
                  xmlns="http://www.w3.org/2000/svg"
                  viewBox="0 0 640 640"
                >
                  <path
                    d="M342.6 81.4C330.1 68.9 309.8 68.9 297.3 81.4L137.3 241.4C124.8 253.9 124.8 274.2 137.3 286.7C149.8 299.2 170.1 299.2 182.6 286.7L288 181.3L288 552C288 569.7 302.3 584 320 584C337.7 584 352 569.7 352 552L352 181.3L457.4 286.7C469.9 299.2 490.2 299.2 502.7 286.7C515.2 274.2 515.2 253.9 502.7 241.4L342.7 81.4z"
                  /></svg
              ></span>
            </p>
          </div>
          <div class="flex mt-10 gap-8">
            <svg
              width="17px"
              fill="white"
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 448 512"
            >
              <path
                d="M224.3 141a115 115 0 1 0 -.6 230 115 115 0 1 0 .6-230zm-.6 40.4a74.6 74.6 0 1 1 .6 149.2 74.6 74.6 0 1 1 -.6-149.2zm93.4-45.1a26.8 26.8 0 1 1 53.6 0 26.8 26.8 0 1 1 -53.6 0zm129.7 27.2c-1.7-35.9-9.9-67.7-36.2-93.9-26.2-26.2-58-34.4-93.9-36.2-37-2.1-147.9-2.1-184.9 0-35.8 1.7-67.6 9.9-93.9 36.1s-34.4 58-36.2 93.9c-2.1 37-2.1 147.9 0 184.9 1.7 35.9 9.9 67.7 36.2 93.9s58 34.4 93.9 36.2c37 2.1 147.9 2.1 184.9 0 35.9-1.7 67.7-9.9 93.9-36.2 26.2-26.2 34.4-58 36.2-93.9 2.1-37 2.1-147.8 0-184.8zM399 388c-7.8 19.6-22.9 34.7-42.6 42.6-29.5 11.7-99.5 9-132.1 9s-102.7 2.6-132.1-9c-19.6-7.8-34.7-22.9-42.6-42.6-11.7-29.5-9-99.5-9-132.1s-2.6-102.7 9-132.1c7.8-19.6 22.9-34.7 42.6-42.6 29.5-11.7 99.5-9 132.1-9s102.7-2.6 132.1 9c19.6 7.8 34.7 22.9 42.6 42.6 11.7 29.5 9 99.5 9 132.1s2.7 102.7-9 132.1z"
              />
            </svg>
            <svg
              width="17px"
              fill="white"
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 512 512"
            >
              <path
                d="M459.4 151.7c.3 4.5 .3 9.1 .3 13.6 0 138.7-105.6 298.6-298.6 298.6-59.5 0-114.7-17.2-161.1-47.1 8.4 1 16.6 1.3 25.3 1.3 49.1 0 94.2-16.6 130.3-44.8-46.1-1-84.8-31.2-98.1-72.8 6.5 1 13 1.6 19.8 1.6 9.4 0 18.8-1.3 27.6-3.6-48.1-9.7-84.1-52-84.1-103l0-1.3c14 7.8 30.2 12.7 47.4 13.3-28.3-18.8-46.8-51-46.8-87.4 0-19.5 5.2-37.4 14.3-53 51.7 63.7 129.3 105.3 216.4 109.8-1.6-7.8-2.6-15.9-2.6-24 0-57.8 46.8-104.9 104.9-104.9 30.2 0 57.5 12.7 76.7 33.1 23.7-4.5 46.5-13.3 66.6-25.3-7.8 24.4-24.4 44.8-46.1 57.8 21.1-2.3 41.6-8.1 60.4-16.2-14.3 20.8-32.2 39.3-52.6 54.3z"
              />
            </svg>
            <svg
              width="17px"
              fill="white"
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 512 512"
            >
              <path
                d="M497.1 366.6c-3.4-9.2-9.8-14.1-17.1-18.2-1.4-.8-2.6-1.5-3.7-1.9-2.2-1.1-4.4-2.2-6.6-3.4-22.8-12.1-40.6-27.3-53-45.4-3.5-5.1-6.6-10.5-9.1-16.1-1.1-3-1-4.7-.2-6.3 .8-1.2 1.7-2.2 2.9-3 3.9-2.6 8-5.2 10.7-7 4.9-3.2 8.8-5.7 11.2-7.4 9.4-6.5 15.9-13.5 20-21.3 2.9-5.4 4.5-11.3 4.9-17.4s-.6-12.2-2.8-17.8c-6.2-16.3-21.6-26.4-40.3-26.4-3.9 0-7.9 .4-11.7 1.2-1 .2-2.1 .5-3.1 .7 .2-11.2-.1-22.9-1.1-34.5-3.5-40.8-17.8-62.1-32.7-79.2-9.5-10.7-20.7-19.7-33.2-26.7-22.6-12.9-48.2-19.4-76.1-19.4s-53.4 6.5-76 19.4c-12.5 7-23.7 16.1-33.3 26.8-14.9 17-29.2 38.4-32.7 79.2-1 11.6-1.2 23.4-1.1 34.5-1-.3-2-.5-3.1-.7-3.9-.8-7.8-1.2-11.7-1.2-18.7 0-34.1 10.1-40.3 26.4-2.2 5.7-3.2 11.8-2.8 17.8s2 12 4.9 17.4c4.1 7.8 10.7 14.7 20 21.3 2.5 1.7 6.4 4.2 11.2 7.4 2.6 1.7 6.5 4.2 10.3 6.7 1.3 .9 2.4 2 3.3 3.3 .8 1.6 .8 3.4-.4 6.6-2.5 5.5-5.5 10.8-8.9 15.8-12.1 17.7-29.4 32.6-51.4 44.6-11.7 6.2-23.9 10.3-29 24.3-3.9 10.5-1.3 22.5 8.5 32.6 3.6 3.8 7.8 6.9 12.4 9.4 9.6 5.3 19.8 9.3 30.3 12.1 2.2 .6 4.3 1.5 6.1 2.7 3.6 3.1 3.1 7.9 7.8 14.8 2.4 3.6 5.4 6.7 9 9.1 10 6.9 21.3 7.4 33.2 7.8 10.8 .4 23 .9 36.9 5.5 5.8 1.9 11.8 5.6 18.7 9.9 16.7 10.3 39.6 24.3 77.8 24.3s61.3-14.1 78.1-24.4c6.9-4.2 12.9-7.9 18.5-9.8 13.9-4.6 26.2-5.1 36.9-5.5 11.9-.5 23.2-.9 33.2-7.8 4.2-2.9 7.7-6.7 10.2-11.2 3.4-5.8 3.4-9.9 6.6-12.8 1.8-1.2 3.7-2.1 5.8-2.6 10.7-2.8 21-6.9 30.8-12.2 4.9-2.6 9.3-6.1 13-10.2l.1-.2c9.2-9.9 11.5-21.5 7.8-31.8zm-34 18.3c-20.7 11.5-34.5 10.2-45.3 17.1-9.1 5.9-3.7 18.5-10.3 23.1-8.1 5.6-32.2-.4-63.2 9.9-25.6 8.5-42 32.8-88 32.8s-62-24.3-88.1-32.9c-31-10.3-55.1-4.2-63.2-9.9-6.6-4.6-1.2-17.2-10.3-23.1-10.7-6.9-24.5-5.7-45.3-17.1-13.2-7.3-5.7-11.8-1.3-13.9 75.1-36.4 87.1-92.6 87.7-96.7 .6-5 1.4-9-4.2-14.1-5.4-5-29.2-19.7-35.8-24.3-10.9-7.6-15.7-15.3-12.2-24.6 2.5-6.5 8.5-8.9 14.9-8.9 2 0 4 .2 6 .7 12 2.6 23.7 8.6 30.4 10.2 .8 .2 1.6 .3 2.5 .3 3.6 0 4.9-1.8 4.6-5.9-.8-13.1-2.6-38.7-.6-62.6 2.8-32.9 13.4-49.2 26-63.6 6.1-6.9 34.5-37 88.9-37S339 74.2 345 81.1c12.6 14.4 23.2 30.7 26 63.6 2.1 23.9 .3 49.5-.6 62.6-.3 4.3 1 5.9 4.6 5.9 .8 0 1.7-.1 2.5-.3 6.7-1.6 18.4-7.6 30.4-10.2 2-.4 4-.7 6-.7 6.4 0 12.4 2.5 14.9 8.9 3.5 9.4-1.2 17-12.2 24.6-6.6 4.6-30.4 19.3-35.8 24.3-5.6 5.1-4.8 9.1-4.2 14.2 .5 4.2 12.5 60.4 87.7 96.7 4.4 2.2 11.9 6.7-1.3 14.1z"
              />
            </svg>
            <svg
              width="17px"
              fill="white"
              xmlns="http://www.w3.org/2000/svg"
              viewBox="0 0 512 512"
            >
              <path
                d="M512 256C512 114.6 397.4 0 256 0S0 114.6 0 256C0 376 82.7 476.8 194.2 504.5l0-170.3-52.8 0 0-78.2 52.8 0 0-33.7c0-87.1 39.4-127.5 125-127.5 16.2 0 44.2 3.2 55.7 6.4l0 70.8c-6-.6-16.5-1-29.6-1-42 0-58.2 15.9-58.2 57.2l0 27.8 83.6 0-14.4 78.2-69.3 0 0 175.9C413.8 494.8 512 386.9 512 256z"
              />
            </svg>
          </div>
        </div>
        <div class="grid grid2 grid-cols-2 col-span-3 w-full">
          <div class="flex flex-col justify-center items-center gap-3">
            <img class="w-[80px] h-[66px]" src="../assets/sbc.png" alt="" />
            <p class="text-center leading-[1.5]">موثق لدى منصة <br />الأعمال</p>
          </div>
          <div class="w-[120%] bg-[var(--red)] pt-10 pb-10 px-15">
            <div class="grid grid-cols-3 gap-4">
              <img
                class="w-[72px] h-[72px]"
                src="../assets/Rectangle 30.png"
                alt=""
              />

              <img
                class="w-[72px] h-[72px]"
                src="../assets/Rectangle 29.png"
                alt=""
              />
              <img
                class="w-[72px] h-[72px]"
                src="../assets/Rectangle 28.png"
                alt=""
              />
            </div>
            <div class="grid grid-cols-3 gap-4 mt-8">
              <img
                class="w-[72px] h-[72px]"
                src="../assets/Rectangle 33.png"
                alt=""
              />

              <img
                class="w-[72px] h-[72px]"
                src="../assets/Rectangle 32.png"
                alt=""
              />
              <img
                class="w-[72px] h-[72px]"
                src="../assets/Rectangle 31.png"
                alt=""
              />
            </div>
          </div>
        </div>
      </div>
      <div class="flex flex-col hidden end justify-center items-center">
        <div class="flex items-center">
          <img class="ml-3" src="../assets/vat.png" alt="" />
          <p>الرقم الضريبي : 546987552</p>
        </div>
        <div class="mt-4 gap-4 flex items-center">
          <img src="../assets/master.png" alt="" />
          <img src="../assets/visa.png" alt="" />
          <img src="../assets/mada.png" alt="" />
          <img src="../assets/paypal.png" alt="" />
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
@media (max-width: 991px) {
  .containerr {
    flex-direction: column;
  }

  .number,
  .visa {
    display: none;
  }

  .first div {
    font-size: 16px;
  }

  .grid1 {
    grid-template-columns: 1fr 1fr;
    grid-template-areas:
      "a b"
      "c c"
      "d d";
  }

  .grid1 > div:nth-child(1) {
    grid-area: a;
  }
  .grid1 > div:nth-child(2) {
    grid-area: b;
  }
  .grid1 > div:nth-child(3) {
    grid-area: c;
  }
  .grid1 > div:nth-child(4) {
    grid-area: d;
  }

  .grid2 {
    display: grid;
    grid-template-columns: 1fr;
    gap: 30px;
    margin-top: 30px;
  }

  .grid2 > div:first-child {
    order: 2;
  }
  .grid2 > div:last-child {
    order: 1;
  }

  .grid2 div,
  .grid1 div {
    width: 100%;
  }

  p.font-bold {
    font-size: 20px;
  }

  p.font-thin,
  .grid1 span {
    font-size: 16px;
  }

  .grid2 p {
    font-size: 10px;
  }
  .end {
    display: flex;
  }
}
</style>
